//Задача № 6
Console.WriteLine("Введите число № 1 ");
int number1 = Convert.ToInt32(Console.ReadLine());
if (number1 % 2 == 0) Console.Write("Четное");
if (number1 % 2 > 0) Console.Write("Нечетное");